dropna()

In [1]:
import pandas as pd

In [3]:
data = {
    "Name": ["Amit", "Sita", None, "Priya", "Vikram", None, "Rohan", "Kiran", "Meera"],
    "Age": [25, 30, 28,None, 40, 29, 32, 26, 31],
    "Salary": [50000, 60000, 55000, None, 80000, 52000, 70000, None, 65000],
    "Performance": ["Good", "Excellent", None, "Excellent", "Good", "Average", "Good", "Poor", "Excellent"]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

     Name   Age   Salary Performance
0    Amit  25.0  50000.0        Good
1    Sita  30.0  60000.0   Excellent
2    None  28.0  55000.0        None
3   Priya   NaN      NaN   Excellent
4  Vikram  40.0  80000.0        Good
5    None  29.0  52000.0     Average
6   Rohan  32.0  70000.0        Good
7   Kiran  26.0      NaN        Poor
8   Meera  31.0  65000.0   Excellent

In [14]:
df.dropna(axis=0, inplace =True)

Here axis 0  means droping missing value in rows

axis 1 means dropping missing values in a columns

In [15]:
df

     Name   Age   Salary Performance
0    Amit  25.0  50000.0        Good
1    Sita  30.0  60000.0   Excellent
4  Vikram  40.0  80000.0        Good
6   Rohan  32.0  70000.0        Good
8   Meera  31.0  65000.0   Excellent